app/views/shared/_shop_switcher.html.erb

      <li class="dropdown-header">Open a shop</li>
      <% Business.order(:name).each do |shop| %>
---
SELECT "businesses".* FROM "businesses" ORDER BY "businesses"."name" ASC