app/controllers/branches_controller.rb

  def index
    @branches = Branch.shop.ordered.map do |branch|
      { branch: branch, staff: branch.staff_count, sales: branch.sales.count,
        purchases: branch.purchases.count }
---
SELECT COUNT(*) FROM "purchases" WHERE "purchases"."branch_id" = $1  [["branch_id", 901]]
SELECT COUNT(*) FROM "sales" WHERE "sales"."branch_id" = $1  [["branch_id", 901]]

  def show
    @staff = @branch.users.order(:full_name)
    @sales_count = @branch.sales.count
---
SELECT "users".* FROM "users" WHERE "users"."branch_id" = $1 ORDER BY "users"."full_name" ASC  [["branch_id", 892]]
SELECT COUNT(*) FROM "sales" WHERE "sales"."branch_id" = $1  [["branch_id", 892]]
SELECT COUNT(*) FROM "users" WHERE "users"."branch_id" = $1  [["branch_id", 892]]

  def create
    @branch = Branch.new(branch_params.merge(business_id: business&.id, provisioned_by: current_user))
    @branch.is_default = true if @branch.branch_type == "main" && Branch.shop.where(is_default: true).none?

    if @branch.save
---
INSERT INTO "branches" ("business_id", "name", "code", "branch_type", "address", "city", "phone", "status", "is_default", "created_at", "updated_at", "provisioned_by_id", "allowed_permissions") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

  def destroy
    if @branch.is_default?
      redirect_to branches_path, alert: "The main branch cannot be deleted."
    elsif @branch.sales.exists? || @branch.purchases.exists?
      redirect_to branches_path, alert: "This branch already has transactions. Suspend it instead."
    elsif @branch.users.exists?
      redirect_to branches_path, alert: "Reassign this branch's staff before deleting it."
    else
      name = @branch.name
      if @branch.destroy
---
SELECT 1 AS one FROM "purchases" WHERE "purchases"."branch_id" = $1 LIMIT $2  [["branch_id", 895], ["LIMIT", 1]]
SELECT 1 AS one FROM "sales" WHERE "sales"."branch_id" = $1 LIMIT $2  [["branch_id", 895], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."branch_id" = $1 LIMIT $2  [["branch_id", 895], ["LIMIT", 1]]
DELETE FROM "branches" WHERE "branches"."id" = $1  [["id", 895]]

  def set_branch
    @branch = Branch.shop.find(params[:id])
---
SELECT "branches".* FROM "branches" WHERE "branches"."id" = $1 LIMIT $2  [["id", 875], ["LIMIT", 1]]