app/controllers/customer_portal_controller.rb

SELECT "vehicle_documents".* FROM "vehicle_documents" WHERE "vehicle_documents"."customer_id" = $1 ORDER BY "vehicle_documents"."created_at" DESC  [["customer_id", 296]]
---
  def show
    @customer = @portal_customer
    @sales = @portal_customer.sales.recent.includes(:payment_mode)
    @plans = portal_plans(@portal_customer.active_sales)
    @payments = @portal_customer.installment_payments.recent.includes(:payment_mode).limit(20)
    @reminders = @portal_customer.installment_reminders.order(sent_at: :desc).limit(10)
    @documents = @portal_customer.vehicle_documents.order(created_at: :desc)