app/controllers/customers_controller.rb

SELECT "installment_plans".* FROM "installment_plans" WHERE "installment_plans"."sale_id" = $1  [["sale_id", 150]]
---
  def show
    @customer = @record
    unless location_allowed?(@record.location_id)
      redirect_to customers_path, alert: "That customer is outside your assigned locations."
      return
    end

    @sales = @record.sales.recent.includes(:payment_mode)
    @plans = InstallmentPlan.shop.where(sale_id: @record.active_sales.select(:id))
                            .where.not(status: "paid")
                            .order(:due_date)
    @payments = @record.installment_payments.recent.includes(:payment_mode).limit(20)