app/controllers/owner_controller.rb

  def index
    @businesses = Business.order(:name).map do |shop|
      {
        business: shop,
        branches: shop.branches.count,
        staff: shop.users.active.count,
        customers: shop.customers.count,
        sales: shop.sales.count,
        revenue: shop.sales.sum { |sale| sale.total_amount.to_d },
        owner: shop.users.where(role: "shop_admin", status: "active").first
---
SELECT "businesses".* FROM "businesses" ORDER BY "businesses"."name" ASC
SELECT "users".* FROM "users" WHERE "users"."business_id" = $1 AND "users"."role" = $2 AND "users"."status" = $3 ORDER BY "users"."id" ASC LIMIT $4  [["business_id", 905], ["role", "shop_admin"], ["status", "active"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" WHERE "users"."role" NOT IN ($1, $2)  [["role", "owner"], ["role", "customer"]]

  def set_business
    @business = Business.find(params[:id])
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT $2  [["id", 924], ["LIMIT", 1]]