app/controllers/passwords_controller.rb

UPDATE "users" SET "password_digest" = $1, "must_change_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_digest", "[FILTERED]"], ["must_change_password", "[FILTERED]"], ["updated_at", "2026-10-07 05:15:39.095463"], ["id", 1917]]
---
  def update
    if params[:current_password].present? && !@user.authenticate(params[:current_password])
      flash.now[:alert] = "Your current password is not correct."
      return render :edit, status: :unprocessable_entity
    end

    if params[:password].blank?
      flash.now[:alert] = "Please type a new password."
      return render :edit, status: :unprocessable_entity
    end

    @user.password = params[:password]
    @user.password_confirmation = params[:password_confirmation]
    @user.must_change_password = false

    if @user.save