app/controllers/sales_controller.rb

SELECT "installment_plans".* FROM "installment_plans" WHERE "installment_plans"."sale_id" = $1  [["sale_id", 151]]
SELECT "agent_commissions".* FROM "agent_commissions" WHERE "agent_commissions"."sale_id" = $1 ORDER BY "agent_commissions"."id" ASC LIMIT $2  [["sale_id", 151], ["LIMIT", 1]]
SELECT "registration_trackings".* FROM "registration_trackings" WHERE "registration_trackings"."sale_id" = $1 LIMIT $2  [["sale_id", 151], ["LIMIT", 1]]
---
  def show
    @plans = @sale.installment_plans.chronological
    @payments = @sale.installment_payments.recent.includes(:payment_mode, :created_by)
    @documents = @sale.vehicle_documents
    @tracking = @sale.registration_tracking
    @cheques = @sale.post_dated_cheques.recent
    @commission = @sale.agent_commissions.first

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1  [["id", 330]]
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT $2  [["id", 153], ["LIMIT", 1]]
---
  def set_sale
    @sale = Sale.shop.includes(:customer, :stock_unit, :agent).find(params[:id])