app/controllers/suppliers_controller.rb

  def ledger
    @supplier = Supplier.shop.find(params[:id])

    entries = []
    @supplier.purchases.where.not(status: "cancelled").includes(:payments).each do |purchase|
---
SELECT "purchases".* FROM "purchases" WHERE "purchases"."supplier_id" = $1 AND "purchases"."status" != $2  [["supplier_id", 65], ["status", "cancelled"]]