app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "username", "password_digest", "role", "phone", "status", "last_login_at", "must_change_password", "failed_login_count", "locked_until", "created_at", "updated_at", "business_id", "branch_id", "customer_id", "permissions_scope", "provisioned_by_id", "custom_permissions") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    @user = User.new(user_params.merge(business_id: tenant_business_id, role: "cashier"))
    assign_role(@user, params.dig(:user, :role))
    @user.provisioned_by = current_user
    apply_role_setup(@user)
    set_password(@user, params.dig(:user, :password), confirmation: params.dig(:user, :password_confirmation))
    @user.username = @user.username.presence || generated_username

    if @user.save

UPDATE "users" SET "updated_at" = $1, "custom_permissions" = $2 WHERE "users"."id" = $3  [["updated_at", "2026-10-07 05:15:31.268444"], ["custom_permissions", "{sales.view,reports.view}"], ["id", 1749]]
---
  def update
    if params[:user].blank?
      return redirect_to users_path, alert: "Nothing to update."
    end

    attributes = params[:user]
    if attributes[:password].present?
      set_password(@user, attributes[:password], confirmation: attributes[:password_confirmation])
      @user.must_change_password = true if @user.password.present?
    end

    assign_role(@user, attributes[:role])

    # Nobody may set the "must change password" flag on their own account
    # through a normal edit; it is set when an admin resets somebody's password.
    permitted = user_params.except(:password, :password_confirmation)
    permitted = permitted.except(:must_change_password) if @user == current_user

    if @user.update(permitted)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1965], ["LIMIT", 1]]
---
  def set_user
    @user = User.shop.find(params[:id])